# GetSlotNumberByCell Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetSlotNumberByCell Method
PanelScheduleView Class See Also
---
Gets the slot number in the circuit table
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetSlotNumberByCell(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function GetSlotNumberByCell ( _
	nRow As Integer, _
	nCol As Integer _
) As Integer
```

Visual C++
---
```text
public:
int GetSlotNumberByCell(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Column Number
nCol
    Type: System..::..Int32
# ### Return Value
Row Number
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace